In [1]:
import numpy as np
l=np.array([1,2,3,3,3,10])
np.exp(l)

array([2.71828183e+00, 7.38905610e+00, 2.00855369e+01, 2.00855369e+01,
       2.00855369e+01, 2.20264658e+04])

In [3]:
import pandas as pd

# Sample sales data
data = {
    'Product': ['A', 'B', 'A', 'C', 'B', 'A', 'C'],
    'Sales': [100, 150, 200, 120, 180, 90, 130]
}

# Create a DataFrame
df = pd.DataFrame(data)

In [4]:
df

  Product  Sales
0       A    100
1       B    150
2       A    200
3       C    120
4       B    180
5       A     90
6       C    130

In [5]:
# Grouping by the 'Product' column
grouped = df.groupby('Product')

grouped

In [6]:
grouped['Sales']

In [7]:
# Calculating the sum of sales for each product category
total_sales = grouped['Sales'].sum()

print(total_sales)

Product
A    390
B    330
C    250
Name: Sales, dtype: int64

In [9]:
df

  Product  Sales
0       A    100
1       B    150
2       A    200
3       C    120
4       B    180
5       A     90
6       C    130

In [12]:
df.groupby("Product").sum()

         Sales
Product
A          390
B          330
C          250